podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/DMAMUX0_8CH_MKL82Z7.svd.xml
<!--
Devices using this peripheral: 
      MKL82Z7
-->
      <peripheral>
         <?sourceFile "DMAMUX0_8CH_MKL82Z7" ?>
         <name>DMAMUX0</name>
         <description>DMA channel multiplexor</description>
         <groupName>DMAMUX</groupName>
         <headerStructName>DMAMUX</headerStructName>
         <baseAddress>0x40021000</baseAddress>
         <size>32</size>
         <access>read-write</access>
         <resetValue>0x0</resetValue>
         <resetMask>0xFFFFFFFF</resetMask>
         <addressBlock>
            <?width "8" ?>
            <offset>0x0</offset>
            <size>0x8</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <dim>8</dim>
               <dimIncrement>1</dimIncrement>
               <dimIndex>0,1,2,3,4,5,6,7</dimIndex>
               <name>CHCFG%s</name>
               <description>Channel Configuration Register</description>
               <addressOffset>0x0</addressOffset>
               <size>8</size>
               <resetMask>0x0</resetMask>
               <fields>
                  <field>
                     <name>SOURCE</name>
                     <description>DMA Channel Source (slot)\n
Specifies which DMA source, if any, is routed to a particular DMA channel</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>Disabled</name>
                           <description>Disabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FlexIO0_Ch0</name>
                           <description>Group1FlexIO0_Channel0</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FlexIO0_Ch1</name>
                           <description>Group1FlexIO0_Channel1</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FlexIO0_Ch2</name>
                           <description>Group1FlexIO0_Channel2</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FlexIO0_Ch3</name>
                           <description>Group1FlexIO0_Channel3</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FlexIO0_Ch4</name>
                           <description>Group1FlexIO0_Channel4</description>
                           <value>5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FlexIO0_Ch5</name>
                           <description>Group1FlexIO0_Channel5</description>
                           <value>6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FlexIO0_Ch6</name>
                           <description>Group1FlexIO0_Channel6</description>
                           <value>7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FlexIO0_Ch7</name>
                           <description>Group1FlexIO0_Channel7</description>
                           <value>8</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>I2C0</name>
                           <description>I2C0</description>
                           <value>9</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>I2C1</name>
                           <description>I2C1</description>
                           <value>10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>Reserved11</name>
                           <description>Reserved</description>
                           <value>11</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>Reserved12</name>
                           <description>Reserved</description>
                           <value>12</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>Reserved13</name>
                           <description>Reserved</description>
                           <value>13</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>Reserved14</name>
                           <description>Reserved</description>
                           <value>14</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LPUART0_Rx</name>
                           <description>LPUART0_Rx</description>
                           <value>15</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LPUART0_Tx</name>
                           <description>LPUART0_Tx</description>
                           <value>16</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LPUART1_Rx</name>
                           <description>LPUART1_Rx</description>
                           <value>17</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LPUART1_Tx</name>
                           <description>LPUART1_Tx</description>
                           <value>18</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LPUART2_Rx</name>
                           <description>LPUART2_Rx</description>
                           <value>19</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LPUART2_Tx</name>
                           <description>LPUART2_Tx</description>
                           <value>20</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SPI0_Rx</name>
                           <description>SPI0_Rx</description>
                           <value>21</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SPI0_Tx</name>
                           <description>SPI0_Tx</description>
                           <value>22</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SPI1_Rx</name>
                           <description>SPI1_Rx</description>
                           <value>23</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SPI1_Tx</name>
                           <description>SPI1_Tx</description>
                           <value>24</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>QSPI0_Rx</name>
                           <description>Group1QSPI0_Rx</description>
                           <value>25</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>QSPI0_Tx</name>
                           <description>Group1QSPI0_Tx</description>
                           <value>26</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TPM0_Ch0</name>
                           <description>TPM0_Channel0</description>
                           <value>27</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TPM0_Ch1</name>
                           <description>TPM0_Channel1</description>
                           <value>28</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TPM0_Ch2</name>
                           <description>TPM0_Channel2</description>
                           <value>29</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TPM0_Ch3</name>
                           <description>TPM0_Channel3</description>
                           <value>30</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TPM0_Ch4</name>
                           <description>TPM0_Channel4</description>
                           <value>31</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TPM0_Ch5</name>
                           <description>TPM0_Channel5</description>
                           <value>32</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>Reserved33</name>
                           <description>Reserved</description>
                           <value>33</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>Reserved34</name>
                           <description>Reserved</description>
                           <value>34</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TPM0_Overflow</name>
                           <description>TPM0_Overflow</description>
                           <value>35</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TPM1_Ch0</name>
                           <description>TPM1_Channel0</description>
                           <value>36</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TPM1_Ch1</name>
                           <description>TPM1_Channel1</description>
                           <value>37</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TPM1_Overflow</name>
                           <description>TPM1_Overflow</description>
                           <value>38</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TPM2_Ch0</name>
                           <description>TPM2_Channel0</description>
                           <value>39</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TPM2_Ch1</name>
                           <description>TPM2_Channel1</description>
                           <value>40</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TPM2_Overflow</name>
                           <description>TPM2_Overflow</description>
                           <value>41</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TSI0</name>
                           <description>TSI0</description>
                           <value>42</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EMVSIM0_Rx</name>
                           <description>Group1EMVSIM0_Rx</description>
                           <value>43</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EMVSIM0_Tx</name>
                           <description>Group1EMVSIM0_Tx</description>
                           <value>44</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EMVSIM1_Rx</name>
                           <description>Group1EMVSIM1_Rx</description>
                           <value>45</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EMVSIM1_Tx</name>
                           <description>Group1EMVSIM1_Tx</description>
                           <value>46</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PortA</name>
                           <description>PortA</description>
                           <value>47</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PortB</name>
                           <description>PortB</description>
                           <value>48</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PortC</name>
                           <description>PortC</description>
                           <value>49</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PortD</name>
                           <description>PortD</description>
                           <value>50</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PortE</name>
                           <description>PortE</description>
                           <value>51</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ADC0</name>
                           <description>ADC0</description>
                           <value>52</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>Reserved53</name>
                           <description>Reserved</description>
                           <value>53</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DAC0</name>
                           <description>DAC0</description>
                           <value>54</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LTC0_PKHA</name>
                           <description>LTC0_PKHA</description>
                           <value>55</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CMP0</name>
                           <description>CMP0</description>
                           <value>56</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>Reserved57</name>
                           <description>Reserved</description>
                           <value>57</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LTC0_Input_FIFO</name>
                           <description>LTC0_Input_FIFO</description>
                           <value>58</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LTC0_Output_FIFO</name>
                           <description>LTC0_Output_FIFO</description>
                           <value>59</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AlwaysEnabled60</name>
                           <description>AlwaysEnabled60</description>
                           <value>60</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AlwaysEnabled61</name>
                           <description>AlwaysEnabled61</description>
                           <value>61</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AlwaysEnabled62</name>
                           <description>AlwaysEnabled62</description>
                           <value>62</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AlwaysEnabled63</name>
                           <description>AlwaysEnabled63</description>
                           <value>63</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TRIG</name>
                     <description>DMA Channel Trigger Enable\n
Enables the periodic trigger capability for the triggered DMA channel</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Request directly routed</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Periodic triggering enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ENBL</name>
                     <description>DMA Channel Enable\n
Usually the Channel enable in the DMA is used in preference to this</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Channel disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Channel enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
